doc/html/02-04-elementos-avancados.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 22:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elementos avançados</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="02-sintaxe.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Elementos avançados</h1>
<p>
Os elementos a seguir  descrevem funcionalidades avançadas de Majestic
Lisp. Algumas delas continuam sendo  comuns a outros dialetos de Lisp,
com suas próprias características de acordo com o <i>design</i> da linguagem.
</p>

<p>
Estes  elementos podem  requerer maior  aprofundamento, por  isso, não
serão exaustivamente explorados.
</p>

<div id="outline-container-orgf59f122" class="outline-2">
<h2 id="orgf59f122"><span class="section-number-2">1.</span> Macros</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Macros</i>  são elementos  muito  importantes em  dialetos  de Lisp,  pois
conferem  flexibilidade  sintática  extra quando  programas  tornam-se
muito  repetitivos.  Diferente  de  outras  linguagens  (como  C,  por
exemplo), o  uso de macros  em Lisp  é muito mais  fácil, e é  uma das
marcas registradas da linguagem, desde que não abusemos dos mesmos.
</p>

<p>
Um  <i>macro</i>  de  Majestic  Lisp  funciona como  uma  função  de  usuário
qualquer.  Todavia,   os  dados   passados  como  parâmetro   não  são
interpretados; antes  disso, o macro  <i>reescreve</i> a expressão  passada a
ele, e então interpreta-a no escopo onde foi invocado.
</p>

<p>
O exemplo a seguir mostra a definição  do macro <code>when</code>. Este macro é uma
especialização da forma especial <code>if</code>,  quando o consequente possui mais
de uma expressão,  e a alternativa pode ser substituída  pelo valor de
retorno <code>nil</code>.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defmac</span> <span style="color: #569cd6;">when</span> <span style="color: #da70d6;">(</span>pred . body<span style="color: #da70d6;">)</span>
  `<span style="color: #da70d6;">(</span><span style="color: #569cd6;">if</span> ,pred <span style="color: #87cefa;">(</span><span style="color: #569cd6;">do</span> ,@body<span style="color: #87cefa;">)</span> nil<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
when
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">when</span> <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">zerop</span> 5<span style="color: #da70d6;">)</span>
  'zero<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
nil
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">when</span> <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">zerop</span> 0<span style="color: #da70d6;">)</span>
  'zero<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
zero
</pre>
</div>
</div>

<div id="outline-container-orgc5e7ced" class="outline-2">
<h2 id="orgc5e7ced"><span class="section-number-2">2.</span> Aplicação parcial</h2>
<div class="outline-text-2" id="text-2">
<p>
Majestic também implementa  algumas ideias que não  estão presentes na
maioria dos Lisps, sendo uma dessas a aplicação parcial de funções.
</p>

<p>
Dada uma função qualquer, é  possível repassar menos argumentos do que
o esperado  para a mesma. Nesse  caso, a expressão retornará  <b>uma nova
função</b>  que  espera, como  parâmetros,  os  argumentos que  não  foram
passados.
</p>

<p>
A função primitiva  <code>eq</code> compara dois símbolos. Por isso,  <code>eq</code> espera por
exatamente dois argumentos:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">eq</span> 'a 'b<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
nil
</pre>


<p>
Poderíamos criar uma função de usuário que compara se um certo símbolo
é <code>eq</code> ao símbolo <code>a</code>. Isso pode ser definido explicitamente:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> is-a <span style="color: #da70d6;">(</span>sym<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">eq</span> 'a sym<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
is-a
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>is-a 'b<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
nil
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>is-a 'a<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
t
</pre>


<p>
Usando aplicação parcial, podemos fazer isso de outra forma. Note que,
como <code>eq</code> espera por dois  argumentos, se passarmos apenas um argumento,
será retornada uma função que espera por apenas um argumento<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">eq</span> 'a<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
#&lt;function (fn (:G191)) {0x562697ac4ab0}&gt;
</pre>


<p>
Se dermos um nome à função retornada, note que teremos nada mais, nada
menos que a exata mesma definição de <code>is-a</code>, como anteriormente feita:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> is-a <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">eq</span> 'a<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
is-a
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>is-a 'b<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
nil
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span>is-a 'a<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
t
</pre>
</div>
</div>

<div id="outline-container-org35b879d" class="outline-2">
<h2 id="org35b879d"><span class="section-number-2">3.</span> Desestruturação de argumentos</h2>
<div class="outline-text-2" id="text-3">
<p>
Outro recurso  de Majestic Lisp  é a desestruturação de  argumentos de
funções. Ao  declararmos uma  função, podemos  tomar um  argumento que
espera-se que  seja uma lista  e o  desestruturarmos de acordo  com os
elementos esperados,  economizando espaço  na digitação do  programa e
desmembramento da mesma.
</p>

<p>
Considere a função  <code>map</code>, que percorre uma lista de  elementos e aplica
uma função a cada  um deles. O retorno de cada  aplicação de função é,
finalmente, acumulado em uma nova lista e retornado.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> <span style="color: #dcdcaa;">map</span> <span style="color: #da70d6;">(</span>f l<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">unless</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">nilp</span> l<span style="color: #87cefa;">)</span>
    <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">cons</span> <span style="color: #ffd700;">(</span>f <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">car</span> l<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
          <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">map</span> f <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">cdr</span> l<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
map
</pre>


<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">map</span> <span style="color: #da70d6;">(</span><span style="color: #569cd6;">fn</span> <span style="color: #87cefa;">(</span>x<span style="color: #87cefa;">)</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">*</span> x x<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
     '<span style="color: #da70d6;">(</span>1 2 3 4 5<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(1 4 9 16 25)
</pre>


<p>
Como o uso de  <code>car</code> e <code>cdr</code> não é muito  didático, um programador poderia
considerar  desmembrar a  lista <code>l</code>  usando <code>let</code>,  antes da  aplicação do
corpo da função:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> <span style="color: #dcdcaa;">map</span> <span style="color: #da70d6;">(</span>f l<span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">let</span> <span style="color: #87cefa;">(</span><span style="color: #ffd700;">(</span>x  <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">car</span> l<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
        <span style="color: #ffd700;">(</span>xs <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">cdr</span> l<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span>
    <span style="color: #87cefa;">(</span><span style="color: #569cd6;">unless</span> <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">nilp</span> x<span style="color: #ffd700;">)</span>
      <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">cons</span> <span style="color: #da70d6;">(</span>f x<span style="color: #da70d6;">)</span>
            <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">map</span> f xs<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
map
</pre>


<p>
Mesmo que essa definição esclareça o corpo do <code>let</code>, ela acaba não sendo
muito compacta.
</p>

<p>
Como  a lista  <code>l</code>  só  possui o  intuito  de  ser desmembrada,  podemos
declarar diretamente  nos argumentos  da função  como ela  deverá ser
desmembrada. Em especial, queremos que o primeiro elemento se chame <code>x</code>,
e que a lista restante, independente de ser ou não vazia, chame-se <code>xs</code>:
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">defn</span> <span style="color: #dcdcaa;">map</span> <span style="color: #da70d6;">(</span>f <span style="color: #87cefa;">(</span>x . xs<span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #569cd6;">unless</span> <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">nilp</span> x<span style="color: #87cefa;">)</span>
    <span style="color: #87cefa;">(</span><span style="color: #dcdcaa;">cons</span> <span style="color: #ffd700;">(</span>f x<span style="color: #ffd700;">)</span>
          <span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">map</span> f xs<span style="color: #ffd700;">)</span><span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
Dessa forma,  <code>l</code> passa a  não estar declarado  no escopo de  <code>map</code>, dando
lugar apenas a sua desestruturação em <code>x</code> e <code>xs</code>.
</p>
</div>

<div id="outline-container-org22c7d1e" class="outline-3">
<h3 id="org22c7d1e">Desestruturação <i>ad-hoc</i>.</h3>
<div class="outline-text-3" id="text-org22c7d1e">
<p>
A  definição do  macro <code>let</code>,  em Majestic  Lisp, faz  uso da  aplicação
instantânea de  funções anônimas.  Isso significa que  todo <code>let</code>  é, na
verdade, uma  aplicação de  função. Isso é  algo pertinente  porque dá
margem para um recurso incidental: é possível realizar desestruturação
de variáveis localmente,  através do uso de <code>let</code>. Isso  significa que é
possível declarar duas  ou mais variáveis a  partir da desestruturação
de uma lista.
</p>

<p>
O  exemplo a  seguir mostra  a desestruturação  de uma  lista em  três
variáveis conhecidas  (<code>a</code>, <code>b</code> e <code>c</code>),  e os demais elementos  da lista são
colocados em uma quarta variável, <code>xs</code>.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">let</span> <span style="color: #da70d6;">(</span><span style="color: #87cefa;">(</span> <span style="color: #ffd700;">(</span>a b c . xs<span style="color: #ffd700;">)</span> '<span style="color: #ffd700;">(</span>1 2 3 4 5<span style="color: #ffd700;">)</span> <span style="color: #87cefa;">)</span><span style="color: #da70d6;">)</span>
  <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">print</span> <span style="color: #ce9178;">"a  = {}\nb  = {}\nc  = {}\nxs = {}"</span>
         a b c xs<span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
a  = 1
b  = 2
c  = 3
xs = (4 5)
nil
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Como  <code>eq</code>  é  uma  função primitiva,  o  argumento da  função
retornada é um símbolo gerado aleatoriamente pelo sistema.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 22:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
